import React from "react";
import { globalStyles } from "../assets/styles/globalStyles";
import { View, Text, SafeAreaView, ScrollView, ImageBackground } from "react-native";
export default function Athkar() {
  return (
    <ImageBackground source={require("../assets/img/a.jpg")} style={globalStyles.container}>
      <View style={globalStyles.wrapper}>
        <SafeAreaView>
          <ScrollView>
            <Text style={globalStyles.item}>
              اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ
              سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِى السَّمَاوَاتِ وَمَا فِى الأَرْضِ
              مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا
              بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ
              مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ
              وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِىُّ
              الْعَظِيمُ
            </Text>
            <Text style={globalStyles.item}>
              آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ
              وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ
              وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ
              وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ
              الْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ
              لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا
              تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا
              تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن
              قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ
              ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا
              فَانصُرْنَا عَلَى الْقَوْمِ *
            </Text>
            <Text style={globalStyles.item}>
              قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ
              يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ( ثلاث مرات )
            </Text>
            <Text style={globalStyles.item}>
              قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِن شَرِّ مَا خَلَقَ * وَمِن
              شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ النَّفَّاثَاتِ فِى
              الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ * ( ثلاث مرات )
            </Text>
            <Text style={globalStyles.item}>
              قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَٰهِ النَّاسِ
              * مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِى يُوَسْوِسُ فِى
              صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ * ( ثلاث مرات )
            </Text>
            <Text style={globalStyles.item}>
              اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ،
              وَالْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ ِ وَغَلَبَةِ
              الدَّيْنِ ، وَقَهْرِ الرِّجَالِ *
            </Text>
            <Text style={globalStyles.item}>
              اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا
              وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ
              فِي دِينِى وَدُنْيَاىَ وَأَهْلِى وَمَالِى، اللَّهُمَّ استُرْ
              عَوْرَاتى ، وآمِنْ رَوْعَاتى ، اللَّهمَّ احْفَظْنِى مِنْ بَينِ
              يَدى َّ، ومِنْ خَلْفى ، وَعن يَمينى ، وعن شِمالى ، ومِن فَوْقِى ،
              وأعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحتى *
            </Text>
            <Text style={globalStyles.item}>
              بسم الله الذى لا يضر مع اسمه شئٌ فى الأرض ولا فى السماء وهو السميع
              العليم * ( ثلاث مرات )
            </Text>
            <Text style={globalStyles.item}>
              سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ
              وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ * ( ثلاث مرات )
            </Text>
            <Text style={globalStyles.item}>
              ياحى يا قيوم برحمتك أستغيث أصلح لى شأنى كله ولا تكلنى إلى نفسى
              طرفة عين
            </Text>
            <Text style={globalStyles.item}>
              رضيت بالله ربًا وبالإسلام دينًا وسيدنا محمد ﷺ نبياًرسولًا * ( ثلاث
              مرات )
            </Text>
            <Text style={globalStyles.item}>
              لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّى كُنْتُ مِنَ
              الظَّالِمِينَ * ( ثلاث مرات )
            </Text>
            <Text style={globalStyles.item}>
              حسبي الله الذى لا إله إلا هو عليه توكلت وهو رب العرش العظيم * (
              سبع مرات )
            </Text>
            <Text style={globalStyles.item}>اللهم أجرنى من النار * ( سبع مرات )</Text>
            <Text style={globalStyles.item}>
              اللَّهُمَّ إِنِّى أَسْأَلُكَ عِلْمًا نَافِعًا ، وَرِزْقًا طَيِّبًا
              ، وَعَمَلًا مُتَقَبَّلًا
            </Text>
            <Text style={globalStyles.item}>
              اللهم بك أصبحنا ( أمسينا ) وبك نحيا وبك نموت وإليك النشور
            </Text>
            <Text style={globalStyles.item}>
              اللهُمَّ مَا أَصْبَحَ ( ما أمسى ) بِى مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ
              مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ
              الْحَمْدُ وَلَكَ الشُّكْرُ *
            </Text>
            <Text style={globalStyles.item}>
              اللهُمَّ لك الحمد كما ينبغى لجلال وجهك وعظيم سلطانك *
            </Text>
            <Text style={globalStyles.item}>
              اللهُمَّ إنى أصبحت ( أمسيت )أشهدك ، وأشهد حملة عرشك ، وملائكتك ،
              وجميع خلقك ، أنك أنت الله لا إله إلا أنت ، وحدك لا شريك لك ، وأن
              محمداً عبدك ورسولك * ( أربع مرات )
            </Text>
            <Text style={globalStyles.item}>
              اللهم عافنى فى بدنى ، اللهم عافنى فى سمعى ، اللهم عافنى فى بصرى ،
              لا إله إلا أنت اللهم إنى أعوذ بك من الكفر والفقر اللهم إنى أعوذ بك
              من عذاب القبر لا إله إلا أنت *
            </Text>
            <Text style={globalStyles.item}>
              اللهم أنت ربى لا إله إلا أنت ، خلقتنى وأنا عبدك ، وأنا على عهدك
              ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك على وأبوء
              بذنبى فاغفر لى فإنه لا يغفر الذنوب إلا أنت
            </Text>
            <Text style={globalStyles.item}>
              اللَّهُمَّ فَاطِرَ السَّموَاتِ والأرْض ، عَالِمَ الغَيْبِ
              والشَّهَادَةِ ِ، رَبَّ كُلِّ شَيءٍ ومَلِيْكَهُ أشْهَدُ أنْ لا
              إلَهَ إلاَّ أنْت َ، أعُوذُ بِكَ مِنْ شَرِّ نَفْسِى ، وَمِنْ شَرِّ
              الشَّيْطَانِ وَشِرْكِه ِ، وأنْ أقْتَرِفَ عَلَى نَفْسِى سُوءاً ،
              أوْ أجُرَّهُ إلَى مُسْلِمٍ
            </Text>
            <Text style={globalStyles.item}>
              أصبحنا وأصبح ( أمسينا وأمسى ) الملك لله ، والحمد لله ، لا إله إلّا
              الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شئٍ قدير *
            </Text>
            <Text style={globalStyles.item}>
              اللهم إنى عبدك ابن عبدك ابن أمتك ناصيتى بيدك ماض فى حكمك عدل فى
              قضاؤك ، أسألك بكل اسم هو لك سميت به نفسك أو أنزلته فى كتابك أو
              علمته أحدا من خلقك أو استأثرت به فى علم الغيب عندك أن تجعل القرآن
              الكريم ربيع قلبى ونور صدرى وجلاء حزنى وذهاب همى*
            </Text>
          </ScrollView>
        </SafeAreaView>
      </View>
    </ImageBackground>
  );
}
